tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling1D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 100000;
    }
    outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    wall1
    {
        type            calculated;
        value           uniform 100000;
    }
    wall2
    {
        type            calculated;
        value           uniform 100000;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
